public class LogicOperator {

//    Поиск суммы элементов массива
//    Задача: Напишите функцию, которая принимает массив чисел и возвращает сумму его элементов.

//    Проверка палиндрома
//    Задача: Напишите функцию, которая принимает строку и возвращает true, если строка является палиндромом, и false в противном случае.

//    Факториал числа
//    Задача: Напишите функцию, которая вычисляет факториал заданного числа.

//    Фибоначчиева последовательность
//    Задача: Напишите функцию, которая принимает число n и возвращает n-ый элемент последовательности Фибоначчи.

//    Поиск максимального/минимального элемента в массиве
//    Задача: Напишите функцию, которая принимает массив чисел и возвращает максимальный (или минимальный) элемент.

//    Линейный поиск
//    Задача: Напишите функцию, которая выполняет линейный поиск элемента в массиве и возвращает индекс этого элемента или -1, если элемент не найден.

//    Поиск гласных букв в строке
//    Задача: Напишите функцию, которая подсчитывает количество гласных букв в данной строке.

//    Обращение строки
//    Задача: Напишите функцию, которая принимает строку и возвращает её в обратном порядке.

//    Сортировка массива
//    Задача: Напишите функцию, которая сортирует массив чисел по возрастанию или убыванию.

//    Проверка на простое число
//    Задача: Напишите функцию, которая определяет, является ли число простым.

}
